zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA266/drivers/fsl_clock.h
/*! @brief Clock ip name array for AOI. */
#define AOI_CLOCKS                       \
    {                                    \
        kCLOCK_GateAOI0, kCLOCK_GateAOI1 \
    }
/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS      \
    {                   \
        kCLOCK_GateCRC0 \
    }
/*! @brief Clock ip name array for CTIMER. */
#define CTIMER_CLOCKS                                                                                      \
    {                                                                                                      \
        kCLOCK_GateCTIMER0, kCLOCK_GateCTIMER1, kCLOCK_GateCTIMER2, kCLOCK_GateCTIMER3, kCLOCK_GateCTIMER4 \
    }
/*! @brief Clock ip name array for DAC. */
#define LPDAC_CLOCKS    \
    {                   \
        kCLOCK_GateDAC0 \
    }
/*! @brief Clock ip name array for DMA. */
#define DMA_CLOCKS      \
    {                   \
        kCLOCK_GateDMA0 \
    }
/*! @brief Clock gate name array for EDMA. */
#define EDMA_CLOCKS     \
    {                   \
        kCLOCK_GateDMA0 \
    }
/*! @brief Clock ip name array for ERM. */
#define ERM_CLOCKS      \
    {                   \
        kCLOCK_GateERM0 \
    }
/*! @brief Clock ip name array for EIM. */
#define EIM_CLOCKS      \
    {                   \
        kCLOCK_GateEIM0 \
    }
/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS                           \
    {                                            \
        kCLOCK_GateFLEXCAN0, kCLOCK_GateFLEXCAN1 \
    }
/*! @brief Clock ip name array for FLEXIO. */
#define FLEXIO_CLOCKS      \
    {                      \
        kCLOCK_GateFLEXIO0 \
    }
/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS     \
    {                     \
        kCLOCK_GateFREQME \
    }
/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS                                                                              \
    {                                                                                            \
        kCLOCK_GateGPIO0, kCLOCK_GateGPIO1, kCLOCK_GateGPIO2, kCLOCK_GateGPIO3, kCLOCK_GateGPIO4 \
    }
/*! @brief Clock ip name array for I3C */
#define I3C_CLOCKS      \
    {                   \
        kCLOCK_GateI3C0 \
    }
/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS      \
    {                        \
        kCLOCK_GateINPUTMUX0 \
    }
/*! @brief Clock ip name array for GPIO. */
#define LPCMP_CLOCKS                                      \
    {                                                     \
        kCLOCK_GateCMP0, kCLOCK_GateCMP1, kCLOCK_GateCMP2 \
    }
/*! @brief Clock ip name array for LPADC. */
#define LPADC_CLOCKS                                                       \
    {                                                                      \
        kCLOCK_GateADC0, kCLOCK_GateADC1, kCLOCK_GateADC2, kCLOCK_GateADC3 \
    }
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                                                       \
    {                                                                                                       \
        kCLOCK_GateLPUART0, kCLOCK_GateLPUART1, kCLOCK_GateLPUART2, kCLOCK_GateLPUART3, kCLOCK_GateLPUART4, \
            kCLOCK_GateLPUART5                                                                              \
    }
/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS                                                               \
    {                                                                              \
        kCLOCK_GateLPI2C0, kCLOCK_GateLPI2C1, kCLOCK_GateLPI2C2, kCLOCK_GateLPI2C3 \
    }
/*! @brief Clock ip name array for LSPI. */
#define LPSPI_CLOCKS                         \
    {                                        \
        kCLOCK_GateLPSPI0, kCLOCK_GateLPSPI1 \
    }
/*! @brief Clock ip name array for MAU. */
#define MAU_CLOCKS      \
    {                   \
        kCLOCK_GateMAU0 \
    }
/*! @brief Clock ip name array for OSTIMER. */
#define OSTIMER_CLOCKS      \
    {                       \
        kCLOCK_GateOSTIMER0 \
    }
/*! @brief Clock ip name array for DAC. */
#define OPAMP_CLOCKS                                                               \
    {                                                                              \
        kCLOCK_GateOPAMP0, kCLOCK_GateOPAMP1, kCLOCK_GateOPAMP2, kCLOCK_GateOPAMP3 \
    }
/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                                         \
    {                                                                                      \
        {kCLOCK_GatePWM0SM0, kCLOCK_GatePWM0SM1, kCLOCK_GatePWM0SM2, kCLOCK_GatePWM0SM3},  \
        {                                                                                  \
            kCLOCK_GatePWM1SM0, kCLOCK_GatePWM1SM1, kCLOCK_GatePWM1SM2, kCLOCK_GatePWM1SM3 \
        }                                                                                  \
    }
/*! @brief Clock ip name array for PKC. */
#define PKC_CLOCKS      \
    {                   \
        kCLOCK_GatePKC0 \
    }
/*! @brief Clock ip name array for PORT. */
#define PORT_CLOCKS                                                                              \
    {                                                                                            \
        kCLOCK_GatePORT0, kCLOCK_GatePORT1, kCLOCK_GatePORT2, kCLOCK_GatePORT3, kCLOCK_GatePORT4 \
    }
/*! @brief Clock ip name array for QDC. */
#define QDC_CLOCKS                       \
    {                                    \
        kCLOCK_GateQDC0, kCLOCK_GateQDC1 \
    }
/*! @brief Clock ip name array for SGI. */
#define SGI_CLOCKS      \
    {                   \
        kCLOCK_GateSGI0 \
    }
/*! @brief Clock ip name array for SLCD. */
#define SLCD_CLOCKS      \
    {                    \
        kCLOCK_GateSLCD0 \
    }
/*! @brief Clock ip name array for SMARTDMA. */
#define SMARTDMA_CLOCKS \
    {                   \
        kCLOCK_Smartdma \
    }
/*! @brief Clock ip name array for TDET. */
#define TDET_CLOCKS      \
    {                    \
        kCLOCK_GateTDET0 \
    }
/*! @brief Clock ip name array for TDET. */
#define TRNG_CLOCKS      \
    {                    \
        kCLOCK_GateTRNG0 \
    }
/*! @brief Clock ip name array for UTICK. */
#define UTICK_CLOCKS      \
    {                     \
        kCLOCK_GateUTICK0 \
    }
/*! @brief Clock ip name array for WWDT. */
#define WWDT_CLOCKS      \
    {                    \
        kCLOCK_GateWWDT0 \
    }

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_MainClk,    /*!< MAIN_CLK                   */
    kCLOCK_CoreSysClk, /*!< Core/system clock(CPU_CLK) */
    kCLOCK_SYSTEM_CLK, /*!< SYSTEM clock/AHB_BUS       */
    kCLOCK_BusClk,     /*!< SYSTEM clock divided by 2  */
    kCLOCK_ExtClk,     /*!< External Clock             */
    kCLOCK_FroHf,      /*!< FRO192                     */
    kCLOCK_FroHfDiv,   /*!< Divided by FRO192          */
    kCLOCK_Clk45M,     /*!< CLK45M                     */
    kCLOCK_Pll1Clk,    /*!< Pll1Clk                    */
    kCLOCK_Pll1ClkDiv, /*!< Pll1CkDiv                  */
    kCLOCK_Fro12M,     /*!< FRO12M                     */
    kCLOCK_Fro12MDiv,  /*!< FRO12MDiv                  */
    kCLOCK_Clk1M,      /*!< CLK1M                      */
    kCLOCK_Fro16K,     /*!< FRO16K                     */
    kCLOCK_Clk16K0,    /*!< CLK16K[0]                  */
    kCLOCK_Clk16K1,    /*!< CLK16K[1]                  */
    kCLOCK_SLOW_CLK,   /*!< SYSTEM_CLK divided by 6    */
} clock_name_t;

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_ATTACH_CLK_SEL(value)    (((uint32_t)(value)) & 0x0000FFFFU)
#define CLK_ATTACH_MUX(reg, sel)     ((((uint32_t)(reg)) << 16U) | (sel))

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_select_name
{
    kCLOCK_SelI3C0_FCLK = (0x0A0U), /*!< I3C0_FCLK clock selection */
    kCLOCK_SelCTIMER0   = (0x0A8U), /*!< CTIMER0   clock selection */
    kCLOCK_SelCTIMER1   = (0x0B0U), /*!< CTIMER1   clock selection */
    kCLOCK_SelCTIMER2   = (0x0B8U), /*!< CTIMER2   clock selection */
    kCLOCK_SelCTIMER3   = (0x0C0U), /*!< CTIMER3   clock selection */
    kCLOCK_SelCTIMER4   = (0x0C8U), /*!< CTIMER4   clock selection */
    kCLOCK_SelFLEXIO0   = (0x0D8U), /*!< FLEXIO0   clock selection */
    kCLOCK_SelLPI2C0    = (0x0E0U), /*!< LPI2C0    clock selection */
    kCLOCK_SelLPI2C1    = (0x0E8U), /*!< LPI2C1    clock selection */
    kCLOCK_SelLPSPI0    = (0x0F0U), /*!< LPSPI0    clock selection */
    kCLOCK_SelLPSPI1    = (0x0F8U), /*!< LPSPI1    clock selection */
    kCLOCK_SelLPUART0   = (0x100U), /*!< LPUART0   clock selection */
    kCLOCK_SelLPUART1   = (0x108U), /*!< LPUART1   clock selection */
    kCLOCK_SelLPUART2   = (0x110U), /*!< LPUART2   clock selection */
    kCLOCK_SelLPUART3   = (0x118U), /*!< LPUART3   clock selection */
    kCLOCK_SelLPUART4   = (0x120U), /*!< LPUART4   clock selection */
    kCLOCK_SelUSB0      = (0x128U), /*!< USB0      clock selection */
    kCLOCK_SelLPTMR0    = (0x130U), /*!< LPTMR0    clock selection */
    kCLOCK_SelOSTIMER0  = (0x138U), /*!< OSTIMER0  clock selection */
    kCLOCK_SelADC       = (0x140U), /*!< ADC0      clock selection */
    kCLOCK_SelCMP0_RR   = (0x150U), /*!< CMP0_RR   clock selection */
    kCLOCK_SelCMP1_RR   = (0x160U), /*!< CMP1_RR   clock selection */
    kCLOCK_SelCMP2_RR   = (0x170U), /*!< CMP2_RR   clock selection */
    kCLOCK_SelDAC0      = (0x178U), /*!< DAC0      clock selection */
    kCLOCK_SelFLEXCAN0  = (0x180U), /*!< FLEXCAN0  clock selection */
    kCLOCK_SelFLEXCAN1  = (0x188U), /*!< FLEXCAN1  clock selection */
    kCLOCK_SelLPI2C2    = (0x190U), /*!< LPI2C2    clock selection */
    kCLOCK_SelLPI2C3    = (0x198U), /*!< LPI2C3    clock selection */
    kCLOCK_SelLPUART5   = (0x1A0U), /*!< LPUART5   clock selection */
    kCLOCK_SelTRACE     = (0x1A8U), /*!< TRACE     clock selection */
    kCLOCK_SelCLKOUT    = (0x1B0U), /*!< CLKOUT    clock selection */
    kCLOCK_SelSCGSCS    = (0x200U), /*!< SCG SCS   clock selection */
    kCLOCK_SelMax       = (0x200U), /*!< MAX       clock selection */
} clock_select_name_t;

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kCLK_IN_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 1U),       /*!< Attach clk_in to MAIN_CLK.     */
    kFRO12M_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 2U),       /*!< Attach FRO_12M to MAIN_CLK.    */
    kFRO_HF_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 3U),       /*!< Attach FRO_HF to MAIN_CLK.     */
    kCLK_16K_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 4U),       /*!< Attach CLK_16K[1] to MAIN_CLK. */
    kPll1Clk_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 6U),       /*!< Attach Pll1Clk to MAIN_CLK.    */
    kNONE_to_MAIN_CLK    = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 7U),       /*!< Attach NONE to MAIN_CLK.       */

