zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA266/drivers/fsl_clock.h
    kFRO_LF_DIV_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 0U), /*!< Attach FRO_LF_DIV to I3C0FCLK. */
    kFRO_HF_DIV_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 2U), /*!< Attach FRO_HF_DIV to I3C0FCLK. */
    kCLK_IN_to_I3C0FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 3U), /*!< Attach CLK_IN to I3C0FCLK.     */
    kCLK_1M_to_I3C0FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 5U), /*!< Attach CLK_1M to I3C0FCLK.     */
    kPll1ClkDiv_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 6U), /*!< Attach Pll1ClkDiv to I3C0FCLK. */
    kNONE_to_I3C0FCLK       = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 7U), /*!< Attach NONE to I3C0FCLK.       */

    kFRO_LF_DIV_to_CTIMER0 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 0U),    /*!< Attach FRO_LF_DIV to CTIMER0. */
    kFRO_HF_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 1U),    /*!< Attach FRO_HF to CTIMER0.     */
    kCLK_IN_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 3U),    /*!< Attach CLK_IN to CTIMER0.     */
    kCLK_16K_to_CTIMER0    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 4U),    /*!< Attach CLK_16K to CTIMER0.    */
    kCLK_1M_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 5U),    /*!< Attach CLK_1M to CTIMER0.     */
    kPll1ClkDiv_to_CTIMER0 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 6U),    /*!< Attach Pll1ClkDiv to CTIMER0. */
    kNONE_to_CTIMER0       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 7U),    /*!< Attach NONE to CTIMER0.       */

    kFRO_LF_DIV_to_CTIMER1 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 0U),    /*!< Attach FRO_LF_DIV to CTIMER1. */
    kFRO_HF_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 1U),    /*!< Attach FRO_HF to CTIMER1.     */
    kCLK_IN_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 3U),    /*!< Attach CLK_IN to CTIMER1.     */
    kCLK_16K_to_CTIMER1    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 4U),    /*!< Attach CLK_16K to CTIMER1.    */
    kCLK_1M_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 5U),    /*!< Attach CLK_1M to CTIMER1.     */
    kPll1ClkDiv_to_CTIMER1 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 6U),    /*!< Attach Pll1ClkDiv to CTIMER1. */
    kNONE_to_CTIMER1       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 7U),    /*!< Attach NONE to CTIMER1.       */

    kFRO_LF_DIV_to_CTIMER2 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 0U),    /*!< Attach FRO_LF_DIV to CTIMER2. */
    kFRO_HF_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 1U),    /*!< Attach FRO_HF to CTIMER2.     */
    kCLK_IN_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 3U),    /*!< Attach CLK_IN to CTIMER2.     */
    kCLK_16K_to_CTIMER2    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 4U),    /*!< Attach CLK_16K to CTIMER2.    */
    kCLK_1M_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 5U),    /*!< Attach CLK_1M to CTIMER2.     */
    kPll1ClkDiv_to_CTIMER2 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 6U),    /*!< Attach Pll1ClkDiv to CTIMER2. */
    kNONE_to_CTIMER2       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 7U),    /*!< Attach NONE to CTIMER2.       */

    kFRO_LF_DIV_to_CTIMER3 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 0U),    /*!< Attach FRO_LF_DIV to CTIMER3. */
    kFRO_HF_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 1U),    /*!< Attach FRO_HF to CTIMER3.     */
    kCLK_IN_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 3U),    /*!< Attach CLK_IN to CTIMER3.     */
    kCLK_16K_to_CTIMER3    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 4U),    /*!< Attach CLK_16K to CTIMER3.    */
    kCLK_1M_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 5U),    /*!< Attach CLK_1M to CTIMER3.     */
    kPll1ClkDiv_to_CTIMER3 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 6U),    /*!< Attach Pll1ClkDiv to CTIMER3. */
    kNONE_to_CTIMER3       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 7U),    /*!< Attach NONE to CTIMER3.       */

    kFRO_LF_DIV_to_CTIMER4 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 0U),    /*!< Attach FRO_LF_DIV to CTIMER4. */
    kFRO_HF_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 1U),    /*!< Attach FRO_HF to CTIMER4.     */
    kCLK_IN_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 3U),    /*!< Attach CLK_IN to CTIMER4.     */
    kCLK_16K_to_CTIMER4    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 4U),    /*!< Attach CLK_16K to CTIMER4.    */
    kCLK_1M_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 5U),    /*!< Attach CLK_1M to CTIMER4.     */
    kPll1ClkDiv_to_CTIMER4 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 6U),    /*!< Attach Pll1ClkDiv to CTIMER4. */
    kNONE_to_CTIMER4       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 7U),    /*!< Attach NONE to CTIMER4.       */

    kFRO_LF_DIV_to_FLEXIO0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 0U),    /*!< Attach FRO_LF_DIV to FLEXIO0. */
    kFRO_HF_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 1U),    /*!< Attach FRO_HF to FLEXIO0.     */
    kCLK_IN_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 3U),    /*!< Attach CLK_IN to FLEXIO0.     */
    kCLK_1M_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 5U),    /*!< Attach CLK_1M to FLEXIO0.     */
    kPll1ClkDiv_to_FLEXIO0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 6U),    /*!< Attach Pll1ClkDiv to FLEXIO0. */
    kNONE_to_FLEXIO0       = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 7U),    /*!< Attach NONE to FLEXIO0.       */

    kFRO_HF_to_FLEXCAN0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 1U),  /*!< Attach FRO_HF to FLEXCAN0.     */
    kFRO_HF_DIV_to_FLEXCAN0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 2U),  /*!< Attach FRO_HF_DIV to FLEXCAN0. */
    kCLK_IN_to_FLEXCAN0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 3U),  /*!< Attach CLK_IN to FLEXCAN0.     */
    kPll1Clk_to_FLEXCAN0    = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 6U),  /*!< Attach Pll1Clk to FLEXCAN0.    */
    kNONE_to_FLEXCAN0       = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 7U),  /*!< Attach NONE to FLEXCAN0.       */

    kFRO_HF_to_FLEXCAN1     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 1U),  /*!< Attach FRO_HF to FLEXCAN1.     */
    kFRO_HF_DIV_to_FLEXCAN1 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 2U),  /*!< Attach FRO_HF_DIV to FLEXCAN1. */
    kCLK_IN_to_FLEXCAN1     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 3U),  /*!< Attach CLK_IN to FLEXCAN1.     */
    kPll1Clk_to_FLEXCAN1    = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 6U),  /*!< Attach Pll1Clk to FLEXCAN1.    */
    kNONE_to_FLEXCAN1       = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 7U),  /*!< Attach NONE to FLEXCAN1.       */

    kFRO_LF_DIV_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 0U),          /*!< Attach FRO_LF_DIV to DAC0.  */
    kFRO_HF_DIV_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 2U),          /*!< Attach FRO_HF_DIV to DAC0.  */
    kCLK_IN_to_DAC0     = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 3U),          /*!< Attach CLK_IN to DAC0.      */
    kCLK_1M_to_DAC0     = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 5U),          /*!< Attach CLK_1M to DAC0.      */
    kPll1ClkDiv_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 6U),          /*!< Attach Pll1ClkDiv to DAC0.  */
    kNONE_to_DAC0       = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 7U),          /*!< Attach NONE to DAC0.        */

    kFRO_LF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 0U),      /*!< Attach FRO_LF_DIV to LPI2C0. */
    kFRO_HF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 2U),      /*!< Attach FRO_HF_DIV to LPI2C0. */
    kCLK_IN_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 3U),      /*!< Attach CLK_IN to LPI2C0.     */
    kCLK_1M_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 5U),      /*!< Attach CLK_1M to LPI2C0.     */
    kPll1ClkDiv_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 6U),      /*!< Attach Pll1ClkDiv to LPI2C0. */
    kNONE_to_LPI2C0       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 7U),      /*!< Attach NONE to LPI2C0.       */

    kFRO_LF_DIV_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 0U),      /*!< Attach FRO_LF_DIV to LPI2C1. */
    kFRO_HF_DIV_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 2U),      /*!< Attach FRO_HF_DIV to LPI2C1. */
    kCLK_IN_to_LPI2C1     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 3U),      /*!< Attach CLK_IN to LPI2C1.     */
    kCLK_1M_to_LPI2C1     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 5U),      /*!< Attach CLK_1M to LPI2C1.     */
    kPll1ClkDiv_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 6U),      /*!< Attach Pll1ClkDiv to LPI2C1. */
    kNONE_to_LPI2C1       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 7U),      /*!< Attach NONE to LPI2C1.       */

