zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA266/drivers/fsl_clock.h
    kFRO_LF_DIV_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 0U),    /*!< Attach FRO_LF_DIV to LPUART5. */
    kFRO_HF_DIV_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 2U),    /*!< Attach FRO_HF_DIV to LPUART5. */
    kCLK_IN_to_LPUART5     = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 3U),    /*!< Attach CLK_IN to LPUART5.     */
    kCLK_16K_to_LPUART5    = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 4U),    /*!< Attach CLK_16K to LPUART5.    */
    kCLK_1M_to_LPUART5     = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 5U),    /*!< Attach CLK_1M to LPUART5.     */
    kPll1ClkDiv_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 6U),    /*!< Attach Pll1ClkDiv to LPUART5. */
    kNONE_to_LPUART5       = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 7U),    /*!< Attach NONE to LPUART5.       */

    kPll1Clk_to_USB0 = CLK_ATTACH_MUX(kCLOCK_SelUSB0, 0U),             /*!< Attach Pll1Clk to USB0. */
    kCLK_45M_to_USB0 = CLK_ATTACH_MUX(kCLOCK_SelUSB0, 1U),             /*!< Attach FRO_HF to USB0.  */
    kCLK_IN_to_USB0  = CLK_ATTACH_MUX(kCLOCK_SelUSB0, 2U),             /*!< Attach CLK_IN to USB0.  */
    kNONE_to_USB0    = CLK_ATTACH_MUX(kCLOCK_SelUSB0, 3U),             /*!< Attach NONE to USB0.    */

    kFRO_LF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 0U),      /*!< Attach FRO_LF_DIV to LPTMR0. */
    kFRO_HF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 2U),      /*!< Attach FRO_HF_DIV to LPTMR0. */
    kCLK_IN_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 3U),      /*!< Attach CLK_IN to LPTMR0.     */
    kCLK_1M_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 5U),      /*!< Attach CLK_1M to LPTMR0.     */
    kPll1ClkDiv_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 6U),      /*!< Attach Pll1ClkDiv to LPTMR0. */
    kNONE_to_LPTMR0       = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 7U),      /*!< Attach NONE to LPTMR0.       */

    kCLK_16K_to_OSTIMER = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 0U),      /*!< Attach FRO16K to OSTIMER0. */
    kCLK_1M_to_OSTIMER  = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 2U),      /*!< Attach CLK_1M to OSTIMER0. */
    kNONE_to_OSTIMER    = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 3U),      /*!< Attach NONE to OSTIMER0.   */

    kFRO_LF_DIV_to_ADC = CLK_ATTACH_MUX(kCLOCK_SelADC, 0U),            /*!< Attach FRO_LF_DIV to ADC. */
    kFRO_HF_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 1U),            /*!< Attach FRO_HF to ADC.     */
    kCLK_IN_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 3U),            /*!< Attach CLK_IN to ADC.     */
    kCLK_1M_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 5U),            /*!< Attach CLK_1M to ADC.     */
    kPll1ClkDiv_to_ADC = CLK_ATTACH_MUX(kCLOCK_SelADC, 6U),            /*!< Attach Pll1ClkDiv to ADC. */
    kNONE_to_ADC       = CLK_ATTACH_MUX(kCLOCK_SelADC, 7U),            /*!< Attach NONE to ADC.       */

    kFRO_LF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 0U),       /*!< Attach FRO_LF_DIV to CMP0. */
    kFRO_HF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 2U),       /*!< Attach FRO_HF_DIV to CMP0. */
    kCLK_IN_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 3U),       /*!< Attach CLK_IN to CMP0.     */
    kCLK_1M_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 5U),       /*!< Attach CLK_1M to CMP0.     */
    kPll1ClkDiv_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 6U),       /*!< Attach Pll1ClkDiv to CMP0. */
    kNONE_to_CMP0       = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 7U),       /*!< Attach NONE to CMP0.       */

    kFRO_LF_DIV_to_CMP1 = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 0U),       /*!< Attach FRO_LF_DIV to CMP1. */
    kFRO_HF_DIV_to_CMP1 = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 2U),       /*!< Attach FRO_HF_DIV to CMP1. */
    kCLK_IN_to_CMP1     = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 3U),       /*!< Attach CLK_IN to CMP1.     */
    kCLK_1M_to_CMP1     = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 5U),       /*!< Attach CLK_1M to CMP1.     */
    kPll1ClkDiv_to_CMP1 = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 6U),       /*!< Attach Pll1ClkDiv to CMP1. */
    kNONE_to_CMP1       = CLK_ATTACH_MUX(kCLOCK_SelCMP1_RR, 7U),       /*!< Attach NONE to CMP1.       */

    kFRO_LF_DIV_to_CMP2 = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 0U),       /*!< Attach FRO_LF_DIV to CMP2. */
    kFRO_HF_DIV_to_CMP2 = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 2U),       /*!< Attach FRO_HF_DIV to CMP2. */
    kCLK_IN_to_CMP2     = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 3U),       /*!< Attach CLK_IN to CMP2.     */
    kCLK_1M_to_CMP2     = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 5U),       /*!< Attach CLK_1M to CMP2.     */
    kPll1ClkDiv_to_CMP2 = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 6U),       /*!< Attach Pll1ClkDiv to CMP2. */
    kNONE_to_CMP2       = CLK_ATTACH_MUX(kCLOCK_SelCMP2_RR, 7U),       /*!< Attach NONE to CMP2.       */

    kCPU_CLK_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 0U),           /*!< Attach CPU_CLK to TRACE. */
    kCLK_1M_to_TRACE  = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 1U),           /*!< Attach CLK_1M to TRACE.  */
    kCLK_16K_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 2U),           /*!< Attach CLK_16K to TRACE. */
    kNONE_to_TRACE    = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 3U),           /*!< Attach NONE to TRACE.    */

    kFRO12M_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 0U),      /*!< Attach FRO_12M to CLKOUT.    */
    kFRO_HF_DIV_to_CLKOUT = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 1U),      /*!< Attach FRO_HF_DIV to CLKOUT. */
    kCLK_IN_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 2U),      /*!< Attach CLK_IN to CLKOUT.     */
    kCLK_16K_to_CLKOUT    = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 3U),      /*!< Attach CLK_16K to CLKOUT.    */
    kPll1Clk_to_CLKOUT    = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 5U),      /*!< Attach Pll1Clk to CLKOUT.    */
    kSLOW_CLK_to_CLKOUT   = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 6U),      /*!< Attach SLOW_CLK to CLKOUT.   */
    kNONE_to_CLKOUT       = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 7U),      /*!< Attach NONE to CLKOUT.       */

    kNONE_to_NONE = (0xFFFFFFFFU),                                     /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivI3C0_FCLK = (0x0A4U), /*!< I3C0_FCLK clock divider */
    kCLOCK_DivCTIMER0   = (0x0ACU), /*!< CTIMER0   clock divider */
    kCLOCK_DivCTIMER1   = (0x0B4U), /*!< CTIMER1   clock divider */
    kCLOCK_DivCTIMER2   = (0x0BCU), /*!< CTIMER2   clock divider */
    kCLOCK_DivCTIMER3   = (0x0C4U), /*!< CTIMER3   clock divider */
    kCLOCK_DivCTIMER4   = (0x0CCU), /*!< CTIMER4   clock divider */
    kCLOCK_DivWWDT0     = (0x0D4U), /*!< WWDT0     clock divider */
    kCLOCK_DivFLEXIO0   = (0x0DCU), /*!< FLEXIO0   clock divider */
    kCLOCK_DivLPI2C0    = (0x0E4U), /*!< LPI2C0    clock divider */
    kCLOCK_DivLPI2C1    = (0x0ECU), /*!< LPI2C1    clock divider */
    kCLOCK_DivLPSPI0    = (0x0F4U), /*!< LPSPI0    clock divider */
    kCLOCK_DivLPSPI1    = (0x0FCU), /*!< LPSPI1    clock divider */
    kCLOCK_DivLPUART0   = (0x104U), /*!< LPUART0   clock divider */
    kCLOCK_DivLPUART1   = (0x10CU), /*!< LPUART1   clock divider */
    kCLOCK_DivLPUART2   = (0x114U), /*!< LPUART2   clock divider */
    kCLOCK_DivLPUART3   = (0x11CU), /*!< LPUART3   clock divider */
    kCLOCK_DivLPUART4   = (0x124U), /*!< LPUART4   clock divider */
    kCLOCK_DivUSB0      = (0x12CU), /*!< USB0      clock divider */
    kCLOCK_DivLPTMR0    = (0x134U), /*!< LPTMR0    clock divider */
    kCLOCK_DivADC       = (0x144U), /*!< ADC       clock divider */
    kCLOCK_DivCMP0_FUNC = (0x14CU), /*!< CMP0_FUNC clock divider */
    kCLOCK_DivCMP0_RR   = (0x154U), /*!< CMP0_RR   clock divider */
    kCLOCK_DivCMP1_FUNC = (0x15CU), /*!< CMP1_FUNC clock divider */
    kCLOCK_DivCMP1_RR   = (0x164U), /*!< CMP1_RR   clock divider */
    kCLOCK_DivCMP2_FUNC = (0x16CU), /*!< CMP2_FUNC clock divider */
    kCLOCK_DivCMP2_RR   = (0x174U), /*!< CMP2_RR   clock divider */
    kCLOCK_DivDAC0      = (0x17CU), /*!< DAC0      clock divider */
    kCLOCK_DivFLEXCAN0  = (0x184U), /*!< FLEXCAN0  clock divider */
    kCLOCK_DivFLEXCAN1  = (0x18CU), /*!< FLEXCAN1  clock divider */
    kCLOCK_DivLPI2C2    = (0x194U), /*!< LPI2C2    clock divider */
    kCLOCK_DivLPI2C3    = (0x19CU), /*!< LPI2C3    clock divider */
    kCLOCK_DivLPUART5   = (0x1A4U), /*!< LPUART5   clock divider */
    kCLOCK_DivTRACE     = (0x1ACU), /*!< DBG_TRACE clock divider */
    kCLOCK_DivCLKOUT    = (0x1B4U), /*!< CLKOUT    clock divider */
    kCLOCK_DivSLOWCLK   = (0x378U), /*!< SLOWCLK   clock divider */
    kCLOCK_DivBUSCLK    = (0x37CU), /*!< BUSCLK    clock divider */
    kCLOCK_DivAHBCLK    = (0x380U), /*!< AHBCLK    clock divider */
    kCLOCK_DivFRO_HF    = (0x388U), /*!< FROHF     clock divider */
    kCLOCK_DivFRO_LF    = (0x38CU), /*!< FROLF     clock divider */
    kCLOCK_DivPLL1CLK   = (0x3E4U), /*!< PLL1CLK   clock divider */
    kCLOCK_DivMax       = (0x3E4U), /*!< MAX       clock divider */
} clock_div_name_t;

/*!
 * @brief firc trim source.
 */
typedef enum _clke_16k
{
    kCLKE_16K_SYSTEM   = VBAT_FROCLKE_CLKE(1U), /*!< To VSYS domain.     */
    kCLKE_16K_COREMAIN = VBAT_FROCLKE_CLKE(2U)  /*!< To VDD_CORE domain. */
} clke_16k_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref sirc_trim_mode_t.*/

